---
kind: property
id: P:Autodesk.Revit.DB.DisciplineTypeId.Architecture
source: html/915f0073-1d04-2b90-98aa-bd83a155cc0d.htm
---
# Autodesk.Revit.DB.DisciplineTypeId.Architecture Property

Architecture.

## Syntax (C#)
```csharp
public static ForgeTypeId Architecture { get; }
```